---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupViewSpecificDiffViews
source: html/833f220b-f53d-bb65-f2fc-5d1693eba42a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupViewSpecificDiffViews Property

You may not create a detail group with view specific elements from different views.

## Syntax (C#)
```csharp
public static FailureDefinitionId GroupViewSpecificDiffViews { get; }
```